import math

#10. За координатами широти і довготи двох точок на Землі у градусах визначте відстань між ними у
#кілометрах. Нехай (x1, y1) і (x2, y2) є кординатами широти і довготи (у градусах) двох точок
#на земній поверхні. Відстань між цими точками у кілометрах обчислюється так: 6371.032 ×
#arccos(sin(x1) × sin(x2) + cos(x1) × cos(x2) × cos(y1 - y2)). Значення
#6371,032 - це середній радіус Землі у кілометрах. Тригонометричні функції Python працюють
#з радіанами. Як результат, необхідно перетворити значення координат із градусів у радіани
#перед обчисленням відстані за формулою. Модуль math містить функцію з ім’ям radians(),
#яка переводить градуси у радіани. Переведення можна зробити і за формулою, на зразок x1 =
#x1 × pi/180, де pi - число Пі. Знайдіть відстань між двома містами Пекін (39.9075000,
#116.3972300) і Київ (50.4546600, 30.5238000) і виведіть значення на екран. Значення
#відстані повинне відображатися у відформатованому вигляді: з використанням трьох знаків
#після десяткової крапки, мінімальною довжиною поля (10), вирівнюванням за правим краєм. На
#даному сайті знайдіть значення координат у десяткових градусах ще для кількох пар міст на
#вибір і визначте відстань у кілометрах між ними. Перевірте правильність визначення відстаней
#між містами, використовуючи один із сервісів вищезгаданого сайту.


x1, y1 = 39.9075, 116.39723  # Пекін
x2, y2 = 50.45466, 30.5238  # Київ 

x1_rad, y1_rad = math.radians(x1), math.radians(y1)
x2_rad, y2_rad  = math.radians(x2), math.radians(y2)

distance = 6371.032 * math.acos(math.sin(x1_rad) * math.sin(x2_rad) + 
                                  math.cos(x1_rad) * math.cos(x2_rad) * 
                                  math.cos(y1_rad - y2_rad))

print(f"Distance between Kyiv and Bejing: {distance:>10.3f} км")
