#Виконайте перетворення значення температури у градусах Цельсія (C) для інших температурних
#шкал: Фаренгейта (F) і Кельвіна (K). Програма повинна відображати еквівалентну температуру у
#градусах Фаренгейта (F = 32 + 9/5 * C). Програма повинна відображати еквівалентну
#температуру у градусах Кельвіна (K = C + 273,15). Результати потрібно вивести на екран у
#відформатованому вигляді: з використанням двох знаків після десяткової крапки, мінімальною
#довжиною поля (15), вирівнюванням по центру. Зверніть увагу, у дійсних числах для розділення
#дробової і цілої частин використовують крапку.

# This code is designed from temperature conversions

celsius = float(input("Provide temperature in celsius: "))
fahrenheit = 32 + (9/5) * celsius
kelvin = celsius + 273.15

print(f"In Fahrenheit: {fahrenheit:^15.2f}")
print(f"In kelvin: {kelvin:^15.2f}")
