#Збережіть ім’я користувача у змінній і додайте на початку і у кінці імені кілька пропусків.
#Простежте за тим, щоб кожна керуюча послідовність (\t і \n) зустрічалася принаймні один раз.
#Виведіть ім’я, щоб було видно пропуски на початку і у кінці рядка. Потім виведіть його знову з
#використанням кожної з функцій видалення пропусків: lstrip(), rstrip() і strip().

user_name = " Oleksandr "

def print_user_name(name):
    print(f"'{name}'")
    print(f"'{name.lstrip()}'")
    print(f"'{name.rstrip()}'")
    print(f"'{name.strip()}'")  

print_user_name(user_name)
